<<<<<<< HEAD
#1.თქვენი დავალება იქნება, რომ ყველა განიხილოთ რა რა არის, როგორ და რისთვის გამოიყენება და მოიყვანოთ ამ მონაცემების მაგალითები

# string არის ნებისმიერი სიმბოლოების ერთობლიობა რომელსაც გარშემო აქვს ბრჭყალები ანუ ()
 # მაგალითად :
 # "abcd"
 # "12345"
 # "blablubla"


# integeri'ი ქართულად ნიშნავს მთელ რიცხვს
 # მაგალითად :
 # 1
 # 10
 # 20
 # 30
 # 200000
 # 100


 # float ქართულად ნიშნავს წილად რიცხვს 
 # მაგალითად 
 # 1.2
 # 3.8
 # 11.9

# boolean
#შედეგი, რომელსაც შეიძლება ჰქონდეს ორი შესაძლო მნიშვნელობიდან მხოლოდ ერთი: true ან false.
#know_georgian=true 



#2.ახსენით რა არის კონკატენაცია (concatenation)

#ორი ან მეტი სტრიქონის ერთ უფრო დიდ სტრიქონში გაერთიანების პროცესი
 


#3. ახსენით რატომ არ შეგვიძლია გავაკეთოთ მათემატიკური ოპერაცია ისეთ რიცხვებზე რომლებიც არის ჩასმული ბრჭყალებში
 
#რიცხვებზე, რომლებიც ჩასმულია ბრჭყალებში, ვერ ვასრულებთ მათემატიკურ ოპერაციებს, რადგან ბრჭყალებში ჩასმული მონაცემები აღიქმება როგორც ტექსტი (სტრიქონი), ხოლო სტრიქონებზე მათემატიკური ოპერაციების შესრულება შეუძლებელია პირდაპირი სახით.



#4. კომენტარის სახით დაწერეთ პასუხი: როგორ უნდა შევამოწმო რა ტიპის არის ჩემი ცვლადი

#გამოვიყენოთ type() ფუნქცია



#5. რა არის explicit და implicit conversion'ები

#explicit conversion - როდესაც ხელით ვცვლით მონაცემთა ტიპს, მაგალითად ამ ფუნქციებით: int(), str(), float()...
#implicit conversion - როდესაც ავტომატურად იცვლება მონაცემთა ტიპი, მაგალითად 2 int'ის გაყოფის შედეგად ყოველთვის ვიღებთ float'ს ანუ თუ 10'ს გავყოფთ 2'ზე მივიღებთ 5.0'ს და არა 5'ს.

#6. ჩამოწერეთ რა შედარების ოპერატორი იცით მათემატიკაში

#> - მეტი, ვიდრე

#< - ნაკლები, ვიდრე

#>= - მეტი ან ტოლი

#<= - ნაკლები ან ტოლი

#== - ტოლი

=======
#1.თქვენი დავალება იქნება, რომ ყველა განიხილოთ რა რა არის, როგორ და რისთვის გამოიყენება და მოიყვანოთ ამ მონაცემების მაგალითები

# string არის ნებისმიერი სიმბოლოების ერთობლიობა რომელსაც გარშემო აქვს ბრჭყალები ანუ ()
 # მაგალითად :
 # "abcd"
 # "12345"
 # "blablubla"


# integeri'ი ქართულად ნიშნავს მთელ რიცხვს
 # მაგალითად :
 # 1
 # 10
 # 20
 # 30
 # 200000
 # 100


 # float ქართულად ნიშნავს წილად რიცხვს 
 # მაგალითად 
 # 1.2
 # 3.8
 # 11.9

# boolean
#შედეგი, რომელსაც შეიძლება ჰქონდეს ორი შესაძლო მნიშვნელობიდან მხოლოდ ერთი: true ან false.
#know_georgian=true 



#2.ახსენით რა არის კონკატენაცია (concatenation)

#ორი ან მეტი სტრიქონის ერთ უფრო დიდ სტრიქონში გაერთიანების პროცესი
 


#3. ახსენით რატომ არ შეგვიძლია გავაკეთოთ მათემატიკური ოპერაცია ისეთ რიცხვებზე რომლებიც არის ჩასმული ბრჭყალებში
 
#რიცხვებზე, რომლებიც ჩასმულია ბრჭყალებში, ვერ ვასრულებთ მათემატიკურ ოპერაციებს, რადგან ბრჭყალებში ჩასმული მონაცემები აღიქმება როგორც ტექსტი (სტრიქონი), ხოლო სტრიქონებზე მათემატიკური ოპერაციების შესრულება შეუძლებელია პირდაპირი სახით.



#4. კომენტარის სახით დაწერეთ პასუხი: როგორ უნდა შევამოწმო რა ტიპის არის ჩემი ცვლადი

#გამოვიყენოთ type() ფუნქცია



#5. რა არის explicit და implicit conversion'ები

#explicit conversion - როდესაც ხელით ვცვლით მონაცემთა ტიპს, მაგალითად ამ ფუნქციებით: int(), str(), float()...
#implicit conversion - როდესაც ავტომატურად იცვლება მონაცემთა ტიპი, მაგალითად 2 int'ის გაყოფის შედეგად ყოველთვის ვიღებთ float'ს ანუ თუ 10'ს გავყოფთ 2'ზე მივიღებთ 5.0'ს და არა 5'ს.

#6. ჩამოწერეთ რა შედარების ოპერატორი იცით მათემატიკაში

#> - მეტი, ვიდრე

#< - ნაკლები, ვიდრე

#>= - მეტი ან ტოლი

#<= - ნაკლები ან ტოლი

#== - ტოლი

>>>>>>> 078f87372618cabe97856ddd7e397bf9bf3f8892
#!= - არატოლი