<<<<<<< HEAD
# 1 უყურეთ ჩანაწერში როგორ ვრეგისტრირდები sololearn'ზე და დარეგისტრირდით თქვენც
#დავრეგისტრირდი


# 2 შედით პითონის კურსზე და შეასრულეთ პირველი გაკვეთილი
#გავაკეთე


# 3 პითონში დაპრინტეთ თქვენი სახელი და გვარი
name = "nika"
surname = "totladze"
print(name + " " + surname)


# 4 პითონში დაპრინტეთ რაიმე წინადადება
about_me ="me miyvars rustavi"
print(about_me)


#5 პითონში დაპრინტეთ ორი რიცხვის ჯამი
print(2+2)


# 6 პითონში დაპრინტეთ ორი რიცხვის ჯამი (სიმბოლოების სახით)
#ვერ მივხვდი

=======
# 1 უყურეთ ჩანაწერში როგორ ვრეგისტრირდები sololearn'ზე და დარეგისტრირდით თქვენც
#დავრეგისტრირდი


# 2 შედით პითონის კურსზე და შეასრულეთ პირველი გაკვეთილი
#გავაკეთე


# 3 პითონში დაპრინტეთ თქვენი სახელი და გვარი
name = "nika"
surname = "totladze"
print(name + " " + surname)


# 4 პითონში დაპრინტეთ რაიმე წინადადება
about_me ="me miyvars rustavi"
print(about_me)


#5 პითონში დაპრინტეთ ორი რიცხვის ჯამი
print(2+2)


# 6 პითონში დაპრინტეთ ორი რიცხვის ჯამი (სიმბოლოების სახით)
#ვერ მივხვდი

>>>>>>> 078f87372618cabe97856ddd7e397bf9bf3f8892
