<<<<<<< HEAD
#1 გაიხსენეთ და ახსენით წესები რომლებიც მუშაობს ყველა ლოგიკურ ოპერატორზე რაც დღეს ვისწავლეთ (and, or, not)

#AND: შედეგი მართალია , თუ ორივე პირობაა მართალია .

#OR : შედეგი მართლია , თუ თუნდაც ერთი პირობაა მართლია.

#NOT : აბრუნებს პირობის საპირისპირო მნიშვნელობას.



#2 შექმენით and ოპერატორის მეშვეობით 5 სხვადასხვა მაგალითი

# 1
(5 > 3) and (8 > 6)

# 2
(5 > 3) and (8 < 6)

# 3
(10 == 10) and (5 != 5)

# 4
(1 < 2) and (2 < 3)

# 5
(4 >= 4) and (3 <= 5)



#3 შექმენით or ოპერატორის მეშვეობით 5 სხვადასხვა მაგალითი

# 1
(5 > 3) or (8 > 6)

# 2 
(5 > 3) or (8 < 6)

# 3
(10 == 10) or (5 != 5)

# 4 
(1 < 2) or (2 > 3)

# 5 
(4 >= 5) or (3 <= 5)



#4 შეურიეთ შედარების და ლოგიკური ოპერატორები და გააკეთეთ 5 მაგალითი

# 1
a = 5; b = 10

# 2 
x = 20; y = 15

# 3 
num = 8

# 4
age = 17

# 5 
score = 50


=======
#1 გაიხსენეთ და ახსენით წესები რომლებიც მუშაობს ყველა ლოგიკურ ოპერატორზე რაც დღეს ვისწავლეთ (and, or, not)

#AND: შედეგი მართალია , თუ ორივე პირობაა მართალია .

#OR : შედეგი მართლია , თუ თუნდაც ერთი პირობაა მართლია.

#NOT : აბრუნებს პირობის საპირისპირო მნიშვნელობას.



#2 შექმენით and ოპერატორის მეშვეობით 5 სხვადასხვა მაგალითი

# 1
(5 > 3) and (8 > 6)

# 2
(5 > 3) and (8 < 6)

# 3
(10 == 10) and (5 != 5)

# 4
(1 < 2) and (2 < 3)

# 5
(4 >= 4) and (3 <= 5)



#3 შექმენით or ოპერატორის მეშვეობით 5 სხვადასხვა მაგალითი

# 1
(5 > 3) or (8 > 6)

# 2 
(5 > 3) or (8 < 6)

# 3
(10 == 10) or (5 != 5)

# 4 
(1 < 2) or (2 > 3)

# 5 
(4 >= 5) or (3 <= 5)



#4 შეურიეთ შედარების და ლოგიკური ოპერატორები და გააკეთეთ 5 მაგალითი

# 1
a = 5; b = 10

# 2 
x = 20; y = 15

# 3 
num = 8

# 4
age = 17

# 5 
score = 50


>>>>>>> 078f87372618cabe97856ddd7e397bf9bf3f8892
