#1

#1
 # SyntaxError
#       არასრული ფუნქციის განსაზღვრა ან არასწორი სიმბოლოები.

#2
 # NameError
        #ეს შეცდომა ხდება, როცა გამოიყენებთ ცვლადს ან ფუნქციას, რომელიც ჯერ არ არის განსაზღვრული.

#3
 #IndexError
    #ეს შეცდომა ჩნდება, როცა სიის ან მასივის არარსებულ ინდექსს მიმართავთ.

#4
 #TypeError
    #ეს შეცდომა ხდება, როცა ოპერაციას ან ფუნქციას არასწორი ტიპის არგუმენტი გადაეცემა.

#5
 #ValueError
    #ეს შეცდომა ხდება, როცა ფუნქციას სწორი ტიპის, მაგრამ არასათანადო მნიშვნელობა გადაეცემა.



#2


#print(my_variable)
    
print("Error: ცვლადი 'my_variable' არ არის განსაზღვრული.")



#4


user_input = "abc"
number = int(user_input)  # ეს გამოიწვევს ValueError-ს
    
print("Error: ვერ გარდაქმნით მოცემულ სტრიქონს მთელ რიცხვად.")
