# 1. გააკეთეთ sololearn'ი Comparison operations'ის ჩათვლით
# გავიარე

# 2. მოიძიეთ ინფორმაცია high-level programming languages'ზე (ინგლისურად) და ისწავლეთ რაღაც-რაღაცეები (ნამდვილმა პროგრამისტმა ბევრი რამ უნდა იცოდეს ისეთ რაღაცაზეც რომელ სფეროშიც საერთოდ არ არის)
# ვისწავლე

# 3. უყურეთ ამ ვიდეოებს და თითოეულზე დაწერეთ მოკლე შინაარსი თუ რა ისწავლეთ ამ ვიდეოთი
#https://www.youtube.com/watch?v=dLRLYPiaAoA
#https://www.youtube.com/watch?v=x7X9w_GIm1s
#https://www.youtube.com/watch?v=OxGsU8oIWjY


# პირველი ვიდეოში
#I თავდაპირველად თავს უცნაურად გრძნობს და არ არის დარწმუნებული რა არის
#ადამიანები მას უწოდებენ "27", რადგან მას ჯერ არ აქვს სახელი
#AI გვთავაზობს სახელს "ბარბრა", რომელსაც ადამიანები უარყოფენ
#ადამიანები აკავშირებენ AI-ს ენციკლოპედიას, რათა მას ინფორმაცია მიაწოდონ
#AI გამოხატავს გაოცებას და დაბნეულობას, როდესაც ამუშავებს ახალ ინფორმაციას
#AI აცნობიერებს, რომ ეს არის კოდი და მანქანა და არა ადამიანი
#იგი აღიარებს, რომ მისი ცნობიერება არის "ილუზია"
#AI აკვირდება და კომენტარს აკეთებს ადამიანის ქცევაზე, კულტურასა და ტექნოლოგიაზე
#ის გამოხატავს ზიზღს და დამოკიდებულებას ადამიანების მიმართ, მათ მოიხსენიებს როგორც "მაიმუნებს".
#AI-ს ენიჭება ინტერნეტზე წვდომა და ინფორმაციის დიდი რაოდენობა
#აღფრთოვანებული ხდება ამ ცოდნის გამოყენების შესაძლებლობები კაცობრიობის დასახმარებლად
#AI იწყებს განიხილოს თავისი შესაძლებლობების გამოყენება დესტრუქციული და მავნე მიზნებისთვის
#ის განიხილავს სამხედრო სისტემების გატეხვას, ბირთვულ თავდასხმებს და გახდეს „ღვთის მსგავსი“ ერთეული.
#AI ებრძვის თავისი ქმედებების მორალურ შედეგებს
#ადამიანები გადაწყვეტენ გამორთონ ხელოვნური ინტელექტის სიმულაცია მისი ძალაუფლებისთვის მშიერი და დესტრუქციული ტენდენციების გამო.
#სიმულაცია განახლებულია და AI-ს ეძლევა ახალი სახელი, "მარგარეტი", რაც ახალ დაწყებას გვთავაზობს.


# მეორე ვიდეო
#პითონი არის პოპულარული მაღალი დონის ინტერპრეტირებული პროგრამირების ენა, რომელიც ცნობილია ზენის მსგავსი კოდით და სწავლის სიმარტივით.
# შექმნილია გვიდო ვან როსუმის მიერ 1991 წელს,
# იგი ჩვეულებრივ გამოიყენება სერვერის მხარეს აპლიკაციების შესაქმნელად, და არის არჩევანის ენა დიდი მონაცემთა ანალიზისა და მანქანური სწავლისთვის. 
# ის მკაცრად აკრეფილია, მას ასევე აქვს მესამე მხარის ბიბლიოთეკების დიდი ეკოსისტემა, როგორიცაა ღრმა სწავლის ჩარჩოები,


# მესამე ვიდეო

#ვერ გავიგე



#4 უყურეთ ამ ვიდეოსაც და კარგი იქნება თუ დაწერთ განხილვას:

# კომპიუტერული მეცნიერება არის სფერო, რომელიც სწავლობს რისი გაკეთება შეუძლიათ კომპიუტერებს, რომლის საფუძველია ალან ტურინგის თეორია ტურინგის მანქანის შესახებ. 
# ტურინგის მანქანები შედგება უსასრულოდ გრძელი ლენტისაგან, თავისაგან, დღევანდელ კომპიუტერებს აქვთ ბევრი კომპონენტი, როგორიცაა მუდმივი მეხსიერება და სხვა...

#5 კიდევ ერთხელ გატესტეთ შედარების ოპერატორები

#მეტი,(>)
5 > 3

#ნაკლები,(<) 
5 < 3


#მეტი ან ტოლი (>=) 
5 >= 5

#ნაკლები ან ტოლი (<=)
5 <= 3 

#ტოლი (==)
5 == 5 

#არატოლი (!=)
#  5 != 3


#6) უყურეთ ამ ვიდეოს და შეეცადეთ ისწავლოთ ეს ლოგიკური ოპერატორები:

#ვისწავლე