#1 გააკეთეთ sololearn'ი Module 1 Quiz'ის ჩათვლით
# გავიარე 


#2 შედით რესურსებში და დღეს რაც დავწერეთ ყველაფერი ისწავლეთ კარგად, მათ შორის ახალი ინგლისური სიტყვებიც
#ვისწავლე


#3 შედეგი რატომ გამოიტანა float და არა int
# print(10 / 2)  output   5.0

#როდესაც Python-ში იყენებთ გაყოფის ოპერატორს /, ის ყოველთვის აბრუნებს float ტიპის მნიშვნელობას, მიუხედავად იმისა, თუ რა ტიპის რიცხვები იყენებთ გაყოფის ოპერაციისას.


#4 დაადეკლარირეთ 10 ცვლადი და ყველა ცვლადს მიეცით განსხვავებული სახელი და მნიშვნელობა, რომლებიც აუცილებლად უნდა შეესაბამებოდეს

#ასაკი
age = 14

#სახელი
name = "Nika"

#სისწრაფე
average_speed = 58.9

#ცოცხალია?
is_alive = True

#მანქანების რაოდენობა
car_count = 0

#სწავლობს პროგრამირებას
is_learning_programming = True

#სად
collage = "GOA"

#რამდენი საათია დღეში
hours_per_day = 24

#წონა
weight = 45.6

#საყვარელი ფერი
favorite_color = "white"


