<<<<<<< HEAD
#1 გააკეთეთ sololearn'ი Module 1 Quiz'ის ჩათვლით
# გავაკეთე


#2 შედით რესურსებში და დღეს რაც დავწერეთ ყველაფერი ისწავლეთ კარგად, მათ შორის ახალი ინგლისური სიტყვებიც
#ვისწავლე


#3 შედეგი რატომ გამოიტანა float და არა int
# print(10 / 2)  output   5.0
#პასუხი

#როდესაც Python-ში იყენებთ გაყოფის ოპერატორს /, ის ყოველთვის აბრუნებს float ტიპის მნიშვნელობას, მიუხედავად იმისა, თუ რა ტიპის რიცხვები იყენებთ გაყოფის ოპერაციისას.


#4 დაადეკლარირეთ 10 ცვლადი და ყველა ცვლადს მიეცით განსხვავებული სახელი და მნიშვნელობა, რომლებიც აუცილებლად უნდა შეესაბამებოდეს

#ასაკი
age = 14

#სახელი
name = "Nika"

#სისწრაფე
average_speed = 58.9

#ცოცხალია?
is_alive = True

#მანქანების რაოდენობა
car_count = 0

#სწავლობს პროგრამირებას
is_learning_programming = True

#სად
collage = "GOA"

#რამდენი საათია დღეში
hours_per_day = 24

#წონა
weight = 45.6

#საყვარელი ფერი
favorite_color = "white"



#5 მოიძიეთ მათემატიკური ოპერაციები პითონში, დასერჩეთ: mathematical operations in python და რასაც ისწავლით გატესტეთ

# მაგალითები:
a = 10
b = 3

# მოდულუსი
print(a % b)  # Output: 1

# ექსპონენტაცია
print(a ** b)  # Output: 1000 (10^3)

# მთლიანი გაყოფა
print(a // b)  # Output: 3 (10 / 3 = 3 remainder 1)



# კომპლექსური რიცხვის მაგალითი
complex_num = 2 + 3j
print(complex_num.real)  # რეალური ნაწილი
print(complex_num.imag)  # წარმოსახვითი ნაწილი


=======
#1 გააკეთეთ sololearn'ი Module 1 Quiz'ის ჩათვლით
# გავაკეთე


#2 შედით რესურსებში და დღეს რაც დავწერეთ ყველაფერი ისწავლეთ კარგად, მათ შორის ახალი ინგლისური სიტყვებიც
#ვისწავლე


#3 შედეგი რატომ გამოიტანა float და არა int
# print(10 / 2)  output   5.0
#პასუხი

#როდესაც Python-ში იყენებთ გაყოფის ოპერატორს /, ის ყოველთვის აბრუნებს float ტიპის მნიშვნელობას, მიუხედავად იმისა, თუ რა ტიპის რიცხვები იყენებთ გაყოფის ოპერაციისას.


#4 დაადეკლარირეთ 10 ცვლადი და ყველა ცვლადს მიეცით განსხვავებული სახელი და მნიშვნელობა, რომლებიც აუცილებლად უნდა შეესაბამებოდეს

#ასაკი
age = 14

#სახელი
name = "Nika"

#სისწრაფე
average_speed = 58.9

#ცოცხალია?
is_alive = True

#მანქანების რაოდენობა
car_count = 0

#სწავლობს პროგრამირებას
is_learning_programming = True

#სად
collage = "GOA"

#რამდენი საათია დღეში
hours_per_day = 24

#წონა
weight = 45.6

#საყვარელი ფერი
favorite_color = "white"



#5 მოიძიეთ მათემატიკური ოპერაციები პითონში, დასერჩეთ: mathematical operations in python და რასაც ისწავლით გატესტეთ

# მაგალითები:
a = 10
b = 3

# მოდულუსი
print(a % b)  # Output: 1

# ექსპონენტაცია
print(a ** b)  # Output: 1000 (10^3)

# მთლიანი გაყოფა
print(a // b)  # Output: 3 (10 / 3 = 3 remainder 1)



# კომპლექსური რიცხვის მაგალითი
complex_num = 2 + 3j
print(complex_num.real)  # რეალური ნაწილი
print(complex_num.imag)  # წარმოსახვითი ნაწილი


>>>>>>> 078f87372618cabe97856ddd7e397bf9bf3f8892
