#1 განიხილეთ ყველა შედარების ოპერატორი რომელიც დღეს ვისწავლეთ, ახსენით როგორ მუშაობს და თითოეულზე რა შემთხვევაში გამოაქვს True და რა შემთხვევაში გამოაქვს False

#2 გატესტეთ ყველა მათგანი


#!= (არათანასწორობა)
#გამოიყენება იმის შესამოწმებლად, თუ ორი მნიშვნელობა არ არის ტოლი.
#აბრუნებს True, თუ მნიშვნელობები განსხვავებულია, წინააღმდეგ შემთხვევაში აბრუნებს False.
print(5 == 3)

# > (მეტობა)
#გამოიყენება იმის შესამოწმებლად, თუ ერთი მნიშვნელობა მეტია მეორეზე.
#აბრუნებს True, თუ პირველი მნიშვნელობა მეორე მნიშვნელობაზე მეტია, წინააღმდეგ შემთხვევაში აბრუნებს False.

print(11 > 3)

#< (ნაკლებობა)
#გამოიყენება იმის შესამოწმებლად, თუ ერთი მნიშვნელობა ნაკლებია მეორეზე.
#აბრუნებს True, თუ პირველი მნიშვნელობა ნაკლებია მეორეზე, წინააღმდეგ შემთხვევაში აბრუნებს False.

print(8 < 10)

#>= 
#გამოიყენება იმის შესამოწმებლად, თუ ერთი მნიშვნელობა მეტია ან ტოლია მეორეზე.
#აბრუნებს True, თუ პირველი მნიშვნელობა მეტია ან ტოლია მეორეზე, წინააღმდეგ შემთხვევაში აბრუნებს False.

print(9 >= 3)

#<= 
#გამოიყენება იმის შესამოწმებლად, თუ ერთი მნიშვნელობა ნაკლებია ან ტოლია მეორეზე.
#აბრუნებს True, თუ პირველი მნიშვნელობა ნაკლებია ან ტოლია მეორეზე, წინააღმდეგ შემთხვევაში აბრუნებს False.

print(7 <= 3)