 # str = string
 # int = integer
 # float
 # boolean

 # სტრინგი არის ნებისმიერი სიმბოლოების ერთობლიობა რომელსაც გარშემო აქვს ბრჭყალები ანუ ()
 # მაგალითად :
 # "abcd"
 # "12345"
 # "./ ,p;123[]"

# integeri'ი ქართულად ნიშნავს მთელ რიცხვს
 # მაგალითად :
 # 1
 # 200
 # 2000000 
 # 10
 # 12
 # 13



 # float ქართულად ნიშნავს წილად რიცხვს 
 # მაგალითად 
 # 1.2
 # 10.8
 # 13.5
 # 47.0


# boolean'ი არის მონაცემთა ტიპი, რომელსაც აქვს მხოლოდ 2 შესაძლო მნიშვნელობა
# ესენი არის True და False (მართლი და ტყუილი)


#True - 1
#False - 0

name = "nika"

print(name)

x = 5

print(x + 5)

# x არის 5, იპოვეთ x + 5

# x = 5
# x + 5 = 10

name = "nika"