#1

# მსგავსებებია: ორივე იყენებს key-value სტრუქტურას მონაცემების შესანახად , ორივე იძლევა საშუალებას, დინამიურად დავამატოთ ან წავშალოთ გასაღებები და მათი მნიშვნელობები.

# განსხვავებაა: py-ის dict-ის გასაღებები უნდა იყოს immutable (მაგალითად, string, int, tuple), ხოლო JavaScript-ის object-ის გასაღებები ყოველთვის არის string ან Symbol , შესრულების სიჩქარე 

# 2

person = {
    "name": "ნიკა",
    "age": 15,
    "greet": lambda: print("გამარჯობა")
}

person["greet"]()



# 3

#1 ფუნქცია არის დამოუკიდებელი კოდის ბლოკი, რომელსაც შეუძლია მიიღოს არგუმენტები, შეასრულოს მოქმედება და დააბრუნოს შედეგი.

# მახასიათებლები:
# დამოუკიდებელია და არ ეკუთვნის კონკრეტულ ობიექტს.
# შეიძლება გამოიძახო ნებისმიერი ადგილიდან.
# აქვს არგუმენტები და შეუძლია დააბრუნოს მნიშვნელობა.


#2 მეთოდი არის ფუნქცია, რომელიც ობიექტის ნაწილი (property) არის. ის ობიექტთანაა დაკავშირებული და ხშირად იყენებს this-ს, რათა იმავე ობიექტის მონაცემებზე იმუშაოს.

# მახასიათებლები:
# ობიექტის შიგნითა და მისი ნაწილი.
# გამოიძახება object.method() ფორმით.
# ხშირად იყენებს this-ს, რათა წვდომა ჰქონდეს ობიექტის მონაცემებზე.

