#შექმენით ცვლადი, სახელად points, რომელიც თავიდან უდრის 50, შემდეგ დაა-update-ეთ ამ ცვლადის მნიშვნელობა, რამოდენიმეჯერ. საბოლოოდ კი დაპრინტეთ ეს ცვლადი

points = 50
#points = 100
#points = 200
 
print(points)

# გასასწორებელი 1age == 156 print(( "1age )

age = 156 
print(age) #ან შეილება print ("age") 

# დაწერეტ პროგრამა, რომელიც შეიცავს ორ integer  ტიპის ცვლადს ( მაგალითდ, a და b ) შემდეგ გამოიანგარიშეთ ამ ცვლადების ჯამი, სხვაობა, ნამრავლი, განაყოფი.

#a + b = (" b + a ") # ჯამი
#a - b = (" b - a ") # სხვაობა
#a * b = (" b * a ") # ნამრვლი
#a : b = (" b : a ") განაყოფი

# დაწერეთ კოდი შეცდომებით  და ქვემოთ მიუწერეთ მისი სწორი ვერსია.

#0name nika) print = nika"
name = (" nika ")
print(name)
