<<<<<<< HEAD
# დავალება 1: შექმენით 3 list და მიუწერეთ კომენტარით ინდექსები
list1 = [10, 20, 30, 40, 50]  # ინდექსები: 0, 1, 2, 3, 4
list2 = ["apple", "banana", "cherry", "date", "elderberry"]  # ინდექსები: 0, 1, 2, 3, 4
list3 = [True, False, True, False, True]  # ინდექსები: 0, 1, 2, 3, 4

# დავალება 2: Indexing-ის მეშვეობით ყველა ლისტიდან გამოიტანეთ მეხუთე ანუ ბოლო ელემენტი
print(list1[4])  # 50
print(list2[4])  # "elderberry"
print(list3[4])  # True

# დავალება 3: გადააკოპირეთ ეს list'ი და indexing'ის მეშვეობით გამოიტანეთ სიტყვა "sunglasses"
words = ["rise", "sun", "glasses"]
sunglasses = words[1] + words[2]
print(sunglasses)  # "sunglasses"

# დავალება 4: შექმენით კიდევ ერთი list'ი და indexing-ის მეშვეობით შეუცვალეთ ბოლო ელემენტის მნიშვნელობა
list4 = [1, 2, 3, 4, 5]
list4[-1] = 10
print(list4)  # [1, 2, 3, 4, 10]

# დავალება 5: ახსენით რას ნიშნავს mutable
# "mutable" ნიშნავს იმას, რომ მონაცემის ტიპი, როგორიცაა list, შეგვიძლია შევცვალოთ (მისი მნიშვნელობები შეგვიძლია გავაკეთოთ სხვანაირად).
# მაგალითად, list შეგვიძლია დავამატოთ ახალი ელემენტები, წავშალოთ ან შევცვალოთ უკვე არსებული ელემენტები.
=======
# დავალება 1: შექმენით 3 list და მიუწერეთ კომენტარით ინდექსები
list1 = [10, 20, 30, 40, 50]  # ინდექსები: 0, 1, 2, 3, 4
list2 = ["apple", "banana", "cherry", "date", "elderberry"]  # ინდექსები: 0, 1, 2, 3, 4
list3 = [True, False, True, False, True]  # ინდექსები: 0, 1, 2, 3, 4

# დავალება 2: Indexing-ის მეშვეობით ყველა ლისტიდან გამოიტანეთ მეხუთე ანუ ბოლო ელემენტი
print(list1[4])  # 50
print(list2[4])  # "elderberry"
print(list3[4])  # True

# დავალება 3: გადააკოპირეთ ეს list'ი და indexing'ის მეშვეობით გამოიტანეთ სიტყვა "sunglasses"
words = ["rise", "sun", "glasses"]
sunglasses = words[1] + words[2]
print(sunglasses)  # "sunglasses"

# დავალება 4: შექმენით კიდევ ერთი list'ი და indexing-ის მეშვეობით შეუცვალეთ ბოლო ელემენტის მნიშვნელობა
list4 = [1, 2, 3, 4, 5]
list4[-1] = 10
print(list4)  # [1, 2, 3, 4, 10]

# დავალება 5: ახსენით რას ნიშნავს mutable
# "mutable" ნიშნავს იმას, რომ მონაცემის ტიპი, როგორიცაა list, შეგვიძლია შევცვალოთ (მისი მნიშვნელობები შეგვიძლია გავაკეთოთ სხვანაირად).
# მაგალითად, list შეგვიძლია დავამატოთ ახალი ელემენტები, წავშალოთ ან შევცვალოთ უკვე არსებული ელემენტები.
>>>>>>> 078f87372618cabe97856ddd7e397bf9bf3f8892
